src/app/components/registrar-clientes/registrar-clientes.component.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ser="http://service.ws.mssanchez.com/"> 
   <soapenv:Header/> 
   <soapenv:Body> 
      <ser:registrarCte> 
         <request> 
            <idOperacion>UID21052021</idOperacion> 
            <sucursal> 
               <idSucursal>1</idSucursal> 
               <idOperador>2</idOperador> 
            </sucursal> 
            <datosCte> 
               <idCliente>0</idCliente> 
               <persona> 
                  <nombre>FRANCISCO</nombre> 
                  <apellidoPaterno>BRAVO</apellidoPaterno> 
                  <apellidoMaterno>ROSASS</apellidoMaterno> 
               </persona> 
               <direccion> 
                  <idPais>1</idPais> 
                  <idEstado>15</idEstado> 
                  <idMunicipio>45</idMunicipio> 
                  <idLocalidad>12</idLocalidad> 
                  <calle>LAS HUERTAS</calle> 
                  <numExt>s/n</numExt> 
                  <numInt>s/n</numInt> 
               </direccion> 
               <identificacion> 
                  <idIdentificacion>1</idIdentificacion> 
                  <folio>78265555</folio> 
                  <fechaEmite>12/08/2009</fechaEmite> 
                  <fechaExpira>12/09/2022</fechaExpira> 
               </identificacion> 
               <lugarNace>tEPEJI</lugarNace> 
               <paisNace>1</paisNace> 
               <idOcupacion>5</idOcupacion> 
               <empresaLabora>Truper</empresaLabora> 
               <idSexo>1</idSexo> 
               <idEdoCivil>1</idEdoCivil> 
               <email>carlos@elektra.com</email> 
               <fechaNace>02/12/2001</fechaNace> 
               <idTelefono>1</idTelefono> 
               <telefono>5567774571</telefono> 
            </datosCte> 
         </request> 
      </ser:registrarCte> 
   </soapenv:Body> 
</soapenv:Envelope>